project/hfm/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    freestream
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            angularOscillatingDisplacement;
	axis		(0 1 0);
	origin		(0.25 0 0);
	angle0		0;
	amplitude	0.0438;
	omega		376.8;
        value           uniform (0 0 0);
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
