project/hfm/system/solverInfo
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U k omega );  // Removed 'e' field


// ************************************************************************* //

